package com.thinkinginjava.executor;

import com.thinkinginjava.runnable.RunnableTest;

import java.util.concurrent.ExecutorService;
import java.util.concurrent.Executors;

public class SingleThreadExecutor {
    public static void main(String[] args) {
        ExecutorService exec = Executors.newSingleThreadExecutor(); // все они используют один поток
        for (int i = 1; i < 5; i++) exec.execute(new RunnableTest());
        exec.shutdown();
        System.out.println("main() waiting for stop RunnebleTest");
    }
}
/* JDK 8, output comsole:
main() waiting for stop RunnebleTest
поток #0, работа потока (10),
поток #0, работа потока (9),
поток #0, работа потока (8),
поток #0, работа потока (7),
поток #0, работа потока (6),
поток #0, работа потока (5),
поток #0, работа потока (4),
поток #0, работа потока (3),
поток #0, работа потока (2),
поток #0, работа потока (1),
поток #0, работа потока (RunnableTest (стоп поток)!),
поток #1, работа потока (10),
поток #1, работа потока (9),
поток #1, работа потока (8),
поток #1, работа потока (7),
поток #1, работа потока (6),
поток #1, работа потока (5),
поток #1, работа потока (4),
поток #1, работа потока (3),
поток #1, работа потока (2),
поток #1, работа потока (1),
поток #1, работа потока (RunnableTest (стоп поток)!),
поток #2, работа потока (10),
поток #2, работа потока (9),
поток #2, работа потока (8),
поток #2, работа потока (7),
поток #2, работа потока (6),
поток #2, работа потока (5),
поток #2, работа потока (4),
поток #2, работа потока (3),
поток #2, работа потока (2),
поток #2, работа потока (1),
поток #2, работа потока (RunnableTest (стоп поток)!),
поток #3, работа потока (10),
поток #3, работа потока (9),
поток #3, работа потока (8),
поток #3, работа потока (7),
поток #3, работа потока (6),
поток #3, работа потока (5),
поток #3, работа потока (4),
поток #3, работа потока (3),
поток #3, работа потока (2),
поток #3, работа потока (1),
поток #3, работа потока (RunnableTest (стоп поток)!),

Process finished with exit code 0
 */
